In [1]:
%matplotlib inline
import numpy as np
import matplotlib.pyplot as plt
from scipy import stats
import pandas as pd

# use seaborn plotting defaults
import seaborn as sns; sns.set()

In [2]:
data = pd.Series(np.random.uniform(size=9),
                 index=[['a','a','a','b','b','c','c','d','d'],
                        [1,2,3,1,3,1,2,2,3]])

data

a  1    0.431510
   2    0.262027
   3    0.088033
b  1    0.165497
   3    0.621810
c  1    0.191558
   2    0.276838
d  2    0.647695
   3    0.666579
dtype: float64

In [3]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [7]:
data.loc['b':'d', data>0.5]

b  3    0.621810
d  2    0.647695
   3    0.666579
dtype: float64

In [8]:
data.unstack()

          1         2         3
a  0.431510  0.262027  0.088033
b  0.165497       NaN  0.621810
c  0.191558  0.276838       NaN
d       NaN  0.647695  0.666579

In [9]:
data.unstack().stack()

a  1    0.431510
   2    0.262027
   3    0.088033
b  1    0.165497
   3    0.621810
c  1    0.191558
   2    0.276838
d  2    0.647695
   3    0.666579
dtype: float64

In [47]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                      index=[["a", "a", "b", "b"], [1, 2, 1, 2]],
                      columns=[["Ohio", "Ohio", "Colorado"],
                              ["Green", "Red", "Green"]])

In [11]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [12]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [13]:
frame.index.nlevels

2

In [15]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [20]:
frame.swaplevel("key1", "key2")

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [25]:
frame.swaplevel(0,1).sort_index()

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [32]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [33]:
frame.groupby(level=1).sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [27]:
frame.T.groupby(level=1).sum()

key1   a      b
key2   1  2   1   2
color
Green  2  8  14  20
Red    1  4   7  10

In [34]:
frame = pd.DataFrame({"a": range(7), "b": range(7, 0, -1),
                       "c": ["one", "one", "one", "two", "two",
                             "two", "two"],
                       "d": [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [42]:
frame2 = frame.set_index(['c',frame.index])
frame2

       a  b  d
c
one 0  0  7  0
    1  1  6  1
    2  2  5  2
two 3  3  4  0
    4  4  3  1
    5  5  2  2
    6  6  1  3

In [43]:
frame2.reset_index()

     c  level_1  a  b  d
0  one        0  0  7  0
1  one        1  1  6  1
2  one        2  2  5  2
3  two        3  3  4  0
4  two        4  4  3  1
5  two        5  5  2  2
6  two        6  6  1  3

In [46]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [50]:
frame.swaplevel(1,0, axis='columns').T

                a     b
                1  2  1   2
Green Ohio      0  3  6   9
Red   Ohio      1  4  7  10
Green Colorado  2  5  8  11

In [52]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "a", "b"],
                     "data1": pd.Series(range(7), dtype="Int64")})

df2 = pd.DataFrame({"key": ["a", "b", "d"],
                     "data2": pd.Series(range(3), dtype="Int64")})

df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [53]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [62]:
pd.merge(df1, df2, on='key', how='right')

  key  data1  data2
0   a      2      0
1   a      4      0
2   a      5      0
3   b      0      1
4   b      1      1
5   b      6      1
6   d   <NA>      2

In [63]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                     "data1": pd.Series(range(6), dtype="Int64")})

df2 = pd.DataFrame({"key": ["a", "b", "a", "b", "d"],
                    "data2": pd.Series(range(5), dtype="Int64")})

df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [64]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [71]:
df2.rename(columns={'data2':'data1'}, inplace=True)
pd.merge(df1,df2, on='key', how='inner')

  key  data1_x  data1_y
0   b        0        1
1   b        0        3
2   b        1        1
3   b        1        3
4   b        5        1
5   b        5        3
6   a        2        0
7   a        2        2
8   a        4        0
9   a        4        2

In [72]:
left1 = pd.DataFrame({"key": ["a", "b", "a", "a", "b", "c"],
                       "value": pd.Series(range(6), dtype="Int64")})

right1 = pd.DataFrame({"group_val": [3.5, 7]}, index=["a", "b"])

left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [73]:
right1

   group_val
a        3.5
b        7.0

In [75]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [76]:
lefth = pd.DataFrame({"key1": ["Ohio", "Ohio", "Ohio",
                                "Nevada", "Nevada"],
                       "key2": [2000, 2001, 2002, 2001, 2002],
                       "data": pd.Series(range(5), dtype="Int64")})
lefth

     key1  key2  data
0    Ohio  2000     0
1    Ohio  2001     1
2    Ohio  2002     2
3  Nevada  2001     3
4  Nevada  2002     4

In [77]:
righth_index = pd.MultiIndex.from_arrays(
     [
         ["Nevada", "Nevada", "Ohio", "Ohio", "Ohio", "Ohio"],
         [2001, 2000, 2000, 2000, 2001, 2002]
     ]
 )

righth = pd.DataFrame({"event1": pd.Series([0, 2, 4, 6, 8, 10], dtype="Int64",
                                            index=righth_index),
                        "event2": pd.Series([1, 3, 5, 7, 9, 11], dtype="Int64",
                                            index=righth_index)})
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [81]:
pd.merge(lefth, righth, left_on=['key1','key2'], right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000     0       4       5
0    Ohio  2000     0       6       7
1    Ohio  2001     1       8       9
2    Ohio  2002     2      10      11
3  Nevada  2001     3       0       1
4  Nevada  2002     4    <NA>    <NA>
4  Nevada  2000  <NA>       2       3

In [82]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                      index=["a", "c", "e"],
                      columns=["Ohio", "Nevada"]).astype("Int64")

right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                       index=["b", "c", "d", "e"],
                      columns=["Missouri", "Alabama"]).astype("Int64")

left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [83]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [85]:
left2.join(right2, on=left2.index)

   Ohio  Nevada  Missouri  Alabama
a     1       2      <NA>     <NA>
c     3       4         9       10
e     5       6        13       14

In [86]:
pd.merge(left2, right2, left_index=True, right_index=True, how='left')

   Ohio  Nevada  Missouri  Alabama
a     1       2      <NA>     <NA>
c     3       4         9       10
e     5       6        13       14

In [87]:
s1 = pd.Series([0, 1], index=["a", "b"], dtype="Int64")

s2 = pd.Series([2, 3, 4], index=["c", "d", "e"], dtype="Int64")

s3 = pd.Series([5, 6], index=["f", "g"], dtype="Int64")

In [92]:
s4 = pd.concat([s1, s3])

In [96]:
pd.concat([s1,s4, s4], axis=1, join='inner')

   0  1  2
a  0  0  0
b  1  1  1

In [133]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(["Ohio", "Colorado"], name="state"),
                     columns=pd.Index(["one", "two", "three"],
                     name="number"))

data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [138]:
data.pivot()

TypeError: DataFrame.pivot() missing 1 required keyword-only argument: 'columns'